In [25]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

# File to Load (Remember to change these)
train_data_to_load=  "data/train.csv"
test_data_to_load =  "data/test.csv"


# Read the train and test Data
train_data = pd.read_csv("data/train.csv")
train_data
test_data = pd.read_csv("data/test.csv")
test_data.head()

test_data["Survived"]=""

# Combine the data into a single dataset
#combined_data = pd.merge(train_data, test_data, how="left", on=["Name","Name"])
Combined_data = train_data.append(test_data)

# Display the data table for preview
Combined_data.head()

C:\Users\sstat\Anaconda3\lib\site-packages\pandas\core\frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0,373450

problem statement
Complete the analysis of what sorts of people were likely to survive.
In particular, to predict which passengers survived the Titanic tragedy.

In [2]:
Combined_data.shape

(1309, 12)

In [3]:
Combined_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       1309 non-null object
Ticket         1309 non-null object
dtypes: float64(2), int64(4), object(6)
memory usage: 132.9+ KB

In [36]:
Combined_data.isnull().sum()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived          0
Ticket            0
dtype: int64

In [37]:
Drop_data= Combined_data.drop(['Name','Ticket','Embarked','Cabin'],axis =1)
Drop_data.head()

    Age     Fare  Parch  PassengerId  Pclass     Sex  SibSp Survived
0  22.0   7.2500      0            1       3    male      1        0
1  38.0  71.2833      0            2       1  female      1        1
2  26.0   7.9250      0            3       3  female      0        1
3  35.0  53.1000      0            4       1  female      1        1
4  35.0   8.0500      0            5       3    male      0        0

In [43]:
Drop_data["Age"].fillna(Drop_data.groupby("Sex")["Age"].transform("mean"),inplace=True)

In [52]:
Drop_data.isna().sum()

Age            0
Fare           1
Parch          0
PassengerId    0
Pclass         0
Sex            0
SibSp          0
Survived       0
dtype: int64

In [55]:
Drop_data= Drop_data[~Drop_data["Fare"].isna()]

In [60]:
Drop_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1308 entries, 0 to 417
Data columns (total 8 columns):
Age            1308 non-null float64
Fare           1308 non-null float64
Parch          1308 non-null int64
PassengerId    1308 non-null int64
Pclass         1308 non-null int64
Sex            1308 non-null int64
SibSp          1308 non-null int64
Survived       1308 non-null object
dtypes: float64(2), int64(5), object(1)
memory usage: 92.0+ KB

In [59]:
mapping = {"female": 1, "male": 0}
Drop_data.Sex.replace(mapping, inplace=True)

In [61]:
train = Drop_data[Drop_data["Survived"]!= '']

In [62]:
test = Drop_data[Drop_data["Survived"]== '']

In [63]:
train.shape, test.shape

((891, 8), (417, 8))

In [ ]:
#Age Analysis
#Dividing Adult and Children Group
Train